#language: ru
@calculator @division

Функция: Деление

  Структура сценария: Деление различных чисел
    Пусть первый аргумент равен <аргумент1>
    Пусть второй аргумент равен <аргумент2>
    Когда выполнена операция деления
    Тогда результат равен <результат>
    Примеры:
      | аргумент1 | аргумент2 | результат |
      |       3.0 |       3.0 |       1.0 |
      |       9.0 |       3.0 |       3.0 |
      |       1.0 |       1.0 |       1.0 |
      |       0.0 |       5.0 |       0.0 |
      |       3.6 |       1.8 |       2.0 |
      |       5.0 |       0.0 |       0.0 |
      |      -9.0 |      -3.0 |       3.0 |
      |      -2.0 |       2.0 |      -1.0 |
      |      12.3 |       4.1 |       3.0 |
      |      -8.0 |      -4.0 |       2.0 |
      |      15.0 |       3.0 |       5.0 |
