#language: ru
@calculator @multiplying

Функция: Умножение

  Структура сценария: Умножение различных чисел
    Пусть первый аргумент равен <аргумент1>
    Пусть второй аргумент равен <аргумент2>
    Когда выполнена операция умножения
    Тогда результат равен <результат>
    Примеры:
      | аргумент1 | аргумент2 | результат |
      |       0.0 |       0.0 |       0.0 |
      |       0.0 |      -1.0 |       0.0 |
      |       1.0 |       0.0 |       0.0 |
      |       1.0 |       2.0 |       2.0 |
      |       3.0 |       4.0 |      12.0 |
      |      -1.0 |       5.0 |      -5.0 |
      |      -3.0 |      -2.0 |       6.0 |
      |       2.1 |       2.0 |       4.2 |
      |      -5.3 |       3.0 |     -15.9 |
      |       4.0 |      -2.0 |      -8.0 |
      |       7.0 |       2.0 |      14.0 |
